xml/wse-usernametoken-sign.xml


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<soap:Header>
		<wsa:Action wsu:Id="Id-05e7af2b-6b25-4cc6-815f-63d733ad9465">http://localhost/WebService/SayHello</wsa:Action>
		<wsa:MessageID wsu:Id="Id-5eb94457-d06a-46e6-8240-60ad2c210f35">uuid:11144b43-52bb-4910-9dbc-fb6cfecc7555</wsa:MessageID>
		<wsa:ReplyTo wsu:Id="Id-010ba9b8-accc-4b24-a116-86bdf214f01e">
			<wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:To wsu:Id="Id-5e4dbeff-66b5-4045-b885-6c8bb95c0080">http://127.0.0.1/WebService/Service1.asmx</wsa:To>
		<wsse:Security soap:mustUnderstand="1">
			<wsu:Timestamp wsu:Id="Timestamp-bcb094f7-602e-4097-8926-9b24fcc78c3c">
				<wsu:Created>2005-09-27T14:47:56Z</wsu:Created>
				<wsu:Expires>2005-09-27T14:52:56Z</wsu:Expires>
			</wsu:Timestamp>
			<wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-4aa301fd-0385-4c41-b5c3-64b92bb0a080">
				<wsse:Username>schmitt</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">Rnv9f16oG5ESOiKddRw+77AYrw8=</wsse:Password>
				<wsse:Nonce>MQJ3k2eIZOFSWaYPt/wQtg==</wsse:Nonce>
				<wsu:Created>2005-09-27T14:47:56Z</wsu:Created>
			</wsse:UsernameToken>
			<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
				<SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
					<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1" />
					<Reference URI="#Id-05e7af2b-6b25-4cc6-815f-63d733ad9465">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<DigestValue>hL6yEOW+ktg73mewKcoq/Evzxmg=</DigestValue>
					</Reference>
					<Reference URI="#Id-5eb94457-d06a-46e6-8240-60ad2c210f35">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<DigestValue>2GKArva9ofxfZ3kH3FvnM0pMV9g=</DigestValue>
					</Reference>
					<Reference URI="#Id-010ba9b8-accc-4b24-a116-86bdf214f01e">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<DigestValue>UiT9NkS4uV0BA7Ys9Qo0VUQqYZI=</DigestValue>
					</Reference>
					<Reference URI="#Id-5e4dbeff-66b5-4045-b885-6c8bb95c0080">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<DigestValue>BEV1L9fp5N3eMjr83GOr/NaBp5Q=</DigestValue>
					</Reference>
					<Reference URI="#Timestamp-bcb094f7-602e-4097-8926-9b24fcc78c3c">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<DigestValue>RphpYnTM00lNcg02COU/4WESOTc=</DigestValue>
					</Reference>
					<Reference URI="#Id-9e5c8b70-49d4-4f0d-a5ad-e1562d0cd001">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<DigestValue>XeSWfMby+Uaw5AqRi0XkbAcr/lw=</DigestValue>
					</Reference>
				</SignedInfo>
				<SignatureValue>mVTyW2+ei6MXyxY6MBKJveq7AWU=</SignatureValue>
				<KeyInfo>
					<wsse:SecurityTokenReference>
						<wsse:Reference URI="#SecurityToken-4aa301fd-0385-4c41-b5c3-64b92bb0a080" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#UsernameToken" />
					</wsse:SecurityTokenReference>
				</KeyInfo>
			</Signature>
		</wsse:Security>
	</soap:Header>
	<soap:Body wsu:Id="Id-9e5c8b70-49d4-4f0d-a5ad-e1562d0cd001">
		<SayHello xmlns="http://localhost/WebService/">
			<name>test</name>
		</SayHello>
	</soap:Body>
</soap:Envelope>
